zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/periph/PERI_QSPI.h
#define QSPI_SPDRR_R12_MASK                      (0x1000U)
#define QSPI_SPDRR_R12_SHIFT                     (12U)
/*! R12 - Receive Data Bit 12 */
#define QSPI_SPDRR_R12(x)                        (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R12_SHIFT)) & QSPI_SPDRR_R12_MASK)

#define QSPI_SPDRR_R13_MASK                      (0x2000U)
#define QSPI_SPDRR_R13_SHIFT                     (13U)
/*! R13 - Receive Data Bit 13 */
#define QSPI_SPDRR_R13(x)                        (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R13_SHIFT)) & QSPI_SPDRR_R13_MASK)

#define QSPI_SPDRR_R14_MASK                      (0x4000U)
#define QSPI_SPDRR_R14_SHIFT                     (14U)
/*! R14 - Receive Data Bit 14 */
#define QSPI_SPDRR_R14(x)                        (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R14_SHIFT)) & QSPI_SPDRR_R14_MASK)

#define QSPI_SPDRR_R15_MASK                      (0x8000U)
#define QSPI_SPDRR_R15_SHIFT                     (15U)
/*! R15 - Receive Data Bit 15 */
#define QSPI_SPDRR_R15(x)                        (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R15_SHIFT)) & QSPI_SPDRR_R15_MASK)
/*! @} */

/*! @name SPDTR - SPI Data Transmit Register */
/*! @{ */

#define QSPI_SPDTR_T0_MASK                       (0x1U)
#define QSPI_SPDTR_T0_SHIFT                      (0U)
/*! T0 - Transmit Data Bit 0 */
#define QSPI_SPDTR_T0(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T0_SHIFT)) & QSPI_SPDTR_T0_MASK)

#define QSPI_SPDTR_T1_MASK                       (0x2U)
#define QSPI_SPDTR_T1_SHIFT                      (1U)
/*! T1 - Transmit Data Bit 1 */
#define QSPI_SPDTR_T1(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T1_SHIFT)) & QSPI_SPDTR_T1_MASK)

#define QSPI_SPDTR_T2_MASK                       (0x4U)
#define QSPI_SPDTR_T2_SHIFT                      (2U)
/*! T2 - Transmit Data Bit 2 */
#define QSPI_SPDTR_T2(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T2_SHIFT)) & QSPI_SPDTR_T2_MASK)

#define QSPI_SPDTR_T3_MASK                       (0x8U)
#define QSPI_SPDTR_T3_SHIFT                      (3U)
/*! T3 - Transmit Data Bit 3 */
#define QSPI_SPDTR_T3(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T3_SHIFT)) & QSPI_SPDTR_T3_MASK)

#define QSPI_SPDTR_T4_MASK                       (0x10U)
#define QSPI_SPDTR_T4_SHIFT                      (4U)
/*! T4 - Transmit Data Bit 4 */
#define QSPI_SPDTR_T4(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T4_SHIFT)) & QSPI_SPDTR_T4_MASK)

#define QSPI_SPDTR_T5_MASK                       (0x20U)
#define QSPI_SPDTR_T5_SHIFT                      (5U)
/*! T5 - Transmit Data Bit 5 */
#define QSPI_SPDTR_T5(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T5_SHIFT)) & QSPI_SPDTR_T5_MASK)

#define QSPI_SPDTR_T6_MASK                       (0x40U)
#define QSPI_SPDTR_T6_SHIFT                      (6U)
/*! T6 - Transmit Data Bit 6 */
#define QSPI_SPDTR_T6(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T6_SHIFT)) & QSPI_SPDTR_T6_MASK)

#define QSPI_SPDTR_T7_MASK                       (0x80U)
#define QSPI_SPDTR_T7_SHIFT                      (7U)
/*! T7 - Transmit Data Bit 7 */
#define QSPI_SPDTR_T7(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T7_SHIFT)) & QSPI_SPDTR_T7_MASK)

#define QSPI_SPDTR_T8_MASK                       (0x100U)
#define QSPI_SPDTR_T8_SHIFT                      (8U)
/*! T8 - Transmit Data Bit 8 */
#define QSPI_SPDTR_T8(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T8_SHIFT)) & QSPI_SPDTR_T8_MASK)

#define QSPI_SPDTR_T9_MASK                       (0x200U)
#define QSPI_SPDTR_T9_SHIFT                      (9U)
/*! T9 - Transmit Data Bit 9 */
#define QSPI_SPDTR_T9(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T9_SHIFT)) & QSPI_SPDTR_T9_MASK)

#define QSPI_SPDTR_T10_MASK                      (0x400U)
#define QSPI_SPDTR_T10_SHIFT                     (10U)
/*! T10 - Transmit Data Bit 10 */
#define QSPI_SPDTR_T10(x)                        (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T10_SHIFT)) & QSPI_SPDTR_T10_MASK)

#define QSPI_SPDTR_T11_MASK                      (0x800U)
#define QSPI_SPDTR_T11_SHIFT                     (11U)
/*! T11 - Transmit Data Bit 11 */
#define QSPI_SPDTR_T11(x)                        (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T11_SHIFT)) & QSPI_SPDTR_T11_MASK)

#define QSPI_SPDTR_T12_MASK                      (0x1000U)
#define QSPI_SPDTR_T12_SHIFT                     (12U)
/*! T12 - Transmit Data Bit 12 */
#define QSPI_SPDTR_T12(x)                        (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T12_SHIFT)) & QSPI_SPDTR_T12_MASK)

#define QSPI_SPDTR_T13_MASK                      (0x2000U)
#define QSPI_SPDTR_T13_SHIFT                     (13U)
/*! T13 - Transmit Data Bit 13 */
#define QSPI_SPDTR_T13(x)                        (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T13_SHIFT)) & QSPI_SPDTR_T13_MASK)

#define QSPI_SPDTR_T14_MASK                      (0x4000U)
#define QSPI_SPDTR_T14_SHIFT                     (14U)
/*! T14 - Transmit Data Bit 14 */
#define QSPI_SPDTR_T14(x)                        (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T14_SHIFT)) & QSPI_SPDTR_T14_MASK)

#define QSPI_SPDTR_T15_MASK                      (0x8000U)
#define QSPI_SPDTR_T15_SHIFT                     (15U)
/*! T15 - Transmit Data Bit 15 */
#define QSPI_SPDTR_T15(x)                        (((uint16_t)(((uint16_t)(x)) << QSPI_SPDTR_T15_SHIFT)) & QSPI_SPDTR_T15_MASK)
/*! @} */

/*! @name SPFIFO - SPI FIFO Control Register */
/*! @{ */

#define QSPI_SPFIFO_FIFO_ENA_MASK                (0x1U)
#define QSPI_SPFIFO_FIFO_ENA_SHIFT               (0U)
/*! FIFO_ENA - FIFO Enable
 *  0b0..FIFOs are disabled and reset.
 *  0b1..FIFOs are enabled. FIFOs retain their status even if SPE is set to 0.
 */
#define QSPI_SPFIFO_FIFO_ENA(x)                  (((uint16_t)(((uint16_t)(x)) << QSPI_SPFIFO_FIFO_ENA_SHIFT)) & QSPI_SPFIFO_FIFO_ENA_MASK)

#define QSPI_SPFIFO_RFWM_MASK                    (0xCU)
#define QSPI_SPFIFO_RFWM_SHIFT                   (2U)
/*! RFWM - Rx FIFO Watermark
 *  0b00..Receive interrupt active when Rx FIFO has at least one word used
 *  0b01..Receive interrupt active when Rx FIFO has at least two words used
 *  0b10..Receive interrupt active when Rx FIFO has at least three words used
 *  0b11..Receive interrupt active when Rx FIFO is full
 */
#define QSPI_SPFIFO_RFWM(x)                      (((uint16_t)(((uint16_t)(x)) << QSPI_SPFIFO_RFWM_SHIFT)) & QSPI_SPFIFO_RFWM_MASK)

